BAS BMEKZU Project/src/Documents/СписаниеМалоценныхАктивовИзЭксплуатации/СписаниеМалоценныхАктивовИзЭксплуатации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>СписаниеМалоценныхАктивовИзЭксплуатации</name>
  <comment>(Общ)</comment>
  <basedOn>Document.ПередачаМалоценныхАктивовВЭксплуатацию</basedOn>
  <registerRecords>AccountingRegister.Хозрасчетный</registerRecords>
  <attributes>
    <name>Организация</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодразделениеОрганизации</name>
    <comment>(Регл)</comment>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>(Общ) Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>УказыватьПартию</name>
    <comment>Если истина, то пользователь должен указывать партию малоценных активов в эксплуатации.</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЧерезКого</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтпускРазрешил</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредседательКомиссии</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ПервыйЧленКомиссии</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ВторойЧленКомиссии</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ТретийЧленКомиссии</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>РучнаяКорректировка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>МалоценныеАктивы</name>
    <comment>(Общ)</comment>
    <attributes>
      <name>Номенклатура</name>
      <comment>(Общ)</comment>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ПартияМалоценныхАктивовВЭксплуатации</name>
      <comment>(Общ)</comment>
      <type>
        <types>DocumentRef.ПередачаМалоценныхАктивовВЭксплуатацию</types>
        <types>DocumentRef.УдалитьВводНачальныхОстатковМалоценныхАктивовВЭксплуатации</types>
        <types>DocumentRef.ПартияМалоценныхАктивовВЭксплуатации</types>
      </type>
    </attributes>
    <attributes>
      <name>ФизЛицо</name>
      <comment>(Общ)</comment>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <comment>(Общ)</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НазначениеИспользования</name>
      <type>
        <types>CatalogRef.НазначенияИспользования</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <comment>(Общ)</comment>
      <type>
        <types>CatalogRef.КлассификаторЕдиницИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Коэффициент</name>
      <comment>(Общ)</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НалоговоеНазначение</name>
      <type>
        <types>CatalogRef.НалоговыеНазначенияАктивовИЗатрат</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

BAS BMEKZU Project/src/AccountingRegisters/Хозрасчетный/Хозрасчетный.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccountingRegister>
  <name>Хозрасчетный</name>
  <chartOfAccounts>ChartOfAccounts.Хозрасчетный</chartOfAccounts>
  <correspondence>true</correspondence>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
    <balance>true</balance>
  </dimensions>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
    <accountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Валютный</accountingFlag>
  </dimensions>
  <dimensions>
    <name>НалоговоеНазначение</name>
    <type>
      <types>CatalogRef.НалоговыеНазначенияАктивовИЗатрат</types>
    </type>
    <accountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.НалоговыйУчет</accountingFlag>
  </dimensions>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
    <balance>true</balance>
    <extDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Суммовой</extDimensionAccountingFlag>
  </resources>
  <resources>
    <name>ВалютнаяСумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
    <accountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Валютный</accountingFlag>
    <extDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Валютный</extDimensionAccountingFlag>
  </resources>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
    <accountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Количественный</accountingFlag>
    <extDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Количественный</extDimensionAccountingFlag>
  </resources>
  <resources>
    <name>КоличествоГолов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
    <accountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Поштучный</accountingFlag>
    <extDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Поштучный</extDimensionAccountingFlag>
  </resources>
  <resources>
    <name>СуммаНУ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
    <accountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.НалоговыйУчет</accountingFlag>
    <extDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Суммовой</extDimensionAccountingFlag>
  </resources>
  <attributes>
    <name>Содержание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерЖурнала</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>2</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СчетДополнительный</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>НеКорректироватьСтоимостьАвтоматически</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерИсходнойПроводки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:AccountingRegister>

BAS BMEKZU Project/src/Enums/ВидыМалоценныхАктивов/ВидыМалоценныхАктивов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыМалоценныхАктивов</name>
  <enumValues>
    <name>МалоценныйБыстроизнашивающийсяПредмет</name>
  </enumValues>
  <enumValues>
    <name>МалоценныйНеоборотныйАктив</name>
  </enumValues>
  <enumValues>
    <name>БиблиотечныеФонды</name>
  </enumValues>
</mdclass:Enum>

BAS BMEKZU Project/src/Documents/СписаниеМалоценныхАктивовИзЭксплуатации/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
// Хранит вид МБП
Перем мМБП;

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ ОБЕСПЕЧЕНИЯ ПРОВЕДЕНИЯ ДОКУМЕНТА

// Процедура определяет параметры учетной политики
//
Процедура ПодготовитьПараметрыУчетнойПолитики(СтруктураШапкиДокумента, Отказ, Заголовок)
	
	СтруктураШапкиДокумента.Вставить("ЕстьНалогНаПрибыльДо2015"       , УчетнаяПолитика.ПлательщикНалогаНаПрибыльДо2015(СтруктураШапкиДокумента.Организация, КонецМесяца(СтруктураШапкиДокумента.Дата)));
	СтруктураШапкиДокумента.Вставить("ЕстьНДС"                        , УчетнаяПолитика.ПлательщикНДС(СтруктураШапкиДокумента.Организация, КонецМесяца(СтруктураШапкиДокумента.Дата)));
	
КонецПроцедуры // ПодготовитьПараметрыУчетнойПолитики()

// Процедура проверяет правильность заполнения реквизитов документа
//
Функция ПроверкаРеквизитов(Отказ, Заголовок) Экспорт

	// Сформируем структуру реквизитов шапки документа
	СтруктураШапкиДокумента = ОбщегоНазначенияРед12.СформироватьСтруктуруШапкиДокумента(ЭтотОбъект);
	СтруктураШапкиДокумента.Вставить("КодОперации", "Списание");
	
	// Получим данные учетной политики
	ПодготовитьПараметрыУчетнойПолитики(СтруктураШапкиДокумента, Отказ, Заголовок);

	Возврат СтруктураШапкиДокумента;

КонецФункции // ПроверкаРеквизитов()

// Подготовливает таблицу для проведения.
//
Функция ПодготовитьТаблицуПоМалоценнымАктивам(СтруктураШапкиДокумента, Отказ, Заголовок)

    Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Док.НомерСтроки                                         КАК НомерСтроки,
	|	Док.ФизЛицо                                             КАК ФизЛицо,
	|	Док.Номенклатура                                        КАК Номенклатура,
	|	ПРЕДСТАВЛЕНИЕ(Док.Номенклатура.БазоваяЕдиницаИзмерения) КАК БазоваяЕдиницаИзмерения,
	|	Док.ПартияМалоценныхАктивовВЭксплуатации                КАК ПартияМалоценныхАктивовВЭксплуатации,
	|	Док.НазначениеИспользования.СчетПередачиБУ              КАК СчетПередачиБУ,
	|	Док.НазначениеИспользования.СчетАмортизацииБУ           КАК СчетАмортизацииБУ,
	|	Док.НалоговоеНазначение                             	КАК НалоговоеНазначение,
	|	Док.НазначениеИспользования                             КАК НазначениеИспользования,
	|	Док.НазначениеИспользования.Владелец                    КАК ВладелецНазначения,
	|	Док.НазначениеИспользования.СпособОтраженияРасходов     КАК СпособОтраженияРасходов,
	|	Док.НазначениеИспользования.ВидМалоценногоАктива        КАК ВидМалоценногоАктива,
	|	Док.Количество * Коэффициент							КАК Количество
	|ИЗ
	|	Документ.СписаниеМалоценныхАктивовИзЭксплуатации.МалоценныеАктивы КАК Док
	|ГДЕ
	|	Док.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", СтруктураШапкиДокумента.Ссылка );
	
	ТаблицаПоМалоценнымАктивам = Запрос.Выполнить().Выгрузить();
	
	Возврат ТаблицаПоМалоценнымАктивам;

КонецФункции 

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ ФОРМИРОВАНИЯ ДВИЖЕНИЙ ДОКУМЕНТА

// По результату запроса по шапке документа формируем движения по регистрам.
//
// Параметры: 
//  РежимПроведения           - режим проведения документа (оперативный или неоперативный),
//  СтруктураШапкиДокумента   - выборка из результата запроса по шапке документа,
//  ТаблицаПоТоварам          - таблица значений, содержащая данные для проведения и проверки ТЧ Товары
//  ТаблицаПоТаре             - таблица значений, содержащая данные для проведения и проверки ТЧ "Возвратная тара",
//  Отказ                     - флаг отказа в проведении,
//  Заголовок                 - строка, заголовок сообщения об ошибке проведения.
//
Процедура ДвиженияПоРегистрам(РежимПроведения, СтруктураШапкиДокумента, ТаблицаПоМалоценнымАктивам, Отказ, Заголовок)

	ПроцедурыМалоценныеАктивы.ДвижениеПартийМалоценныхАктивов(СтруктураШапкиДокумента, ТаблицаПоМалоценнымАктивам, Движения.Хозрасчетный, Отказ, Заголовок);
	
КонецПроцедуры // ДвиженияПоРегистрам()

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

// Процедура - обработчик события ОбработкаПроведения
//
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Заголовок = ОбщегоНазначенияБПВызовСервера.ПредставлениеДокументаПриПроведении(Ссылка);
	
	// ПОДГОТОВКА ПРОВЕДЕНИЯ ПО ДАННЫМ ДОКУМЕНТА

	ПроведениеСервер.ПодготовитьНаборыЗаписейКПроведению(ЭтотОбъект);
	Если РучнаяКорректировка Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураШапкиДокумента = ПроверкаРеквизитов(Отказ, Заголовок);

	ТаблицаПоМалоценнымАктивам = ПодготовитьТаблицуПоМалоценнымАктивам(СтруктураШапкиДокумента, Отказ, Заголовок);
	
	// Движения по документу.
	Если НЕ Отказ Тогда
		
		ДвиженияПоРегистрам(РежимПроведения, СтруктураШапкиДокумента, ТаблицаПоМалоценнымАктивам, Отказ, Заголовок);
		
	КонецЕсли;
	
	Движения.Хозрасчетный.ВыполнитьДействияПередЗаписьюДвижений();

	ПроведениеСервер.ПодготовитьНаборыЗаписейКЗаписиДвижений(ЭтотОбъект);
	
КонецПроцедуры	// ОбработкаПроведения()

Процедура ЗаполнитьПоДокументуОснованию(ДанныеЗаполнения)

	ТипОснования = ТипЗнч(ДанныеЗаполнения);

	Если ТипОснования = Тип("ДокументСсылка.ПередачаМалоценныхАктивовВЭксплуатацию") Тогда

		// Заполним реквизиты из стандартного набора по документу основанию.
		ЗаполнениеДокументов.ЗаполнитьПоОснованию(ЭтотОбъект, ДанныеЗаполнения);

		// Заполнение шапки
		Комментарий              = ДанныеЗаполнения.Комментарий;
		УказыватьПартию          = Истина;
		
		// Заполнение табличной части "МалоценныеАктивы"
		Для Каждого СтрокаТЧ Из ДанныеЗаполнения.МалоценныеАктивы Цикл
			
			НоваяСтрока = МалоценныеАктивы.Добавить();
			
			НоваяСтрока.Номенклатура                  = СтрокаТЧ.Номенклатура;
			НоваяСтрока.НазначениеИспользования       = СтрокаТЧ.НазначениеИспользования;
			НоваяСтрока.ФизЛицо 				      = СтрокаТЧ.ФизЛицо;
			НоваяСтрока.ПартияМалоценныхАктивовВЭксплуатации  = ДанныеЗаполнения;
			НоваяСтрока.Количество                    = СтрокаТЧ.Количество;
			НоваяСтрока.ЕдиницаИзмерения              = СтрокаТЧ.ЕдиницаИзмерения;
			НоваяСтрока.Коэффициент              	  = СтрокаТЧ.Коэффициент;
			
			НоваяСтрока.НалоговоеНазначение       	  = СтрокаТЧ.НалоговоеНазначение;
			
		КонецЦикла;


	КонецЕсли;

КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения)

	ТипДанныхЗаполнения = ТипЗнч(ДанныеЗаполнения);
	Если ДанныеЗаполнения <> Неопределено
			И ТипДанныхЗаполнения <> Тип("Структура")
			И Метаданные().ВводитсяНаОсновании.Содержит(ДанныеЗаполнения.Метаданные()) Тогда
		ЗаполнитьПоДокументуОснованию(ДанныеЗаполнения);
	КонецЕсли;
	ЗаполнениеДокументов.Заполнить(ЭтотОбъект, ДанныеЗаполнения);

КонецПроцедуры

// Процедура вызывается перед записью документа 
//
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ УказыватьПартию И МалоценныеАктивы.Количество() > 0 Тогда
		
		// Очистка реквизита ПартияМатериаловВЭксплуатации
		МассивОчистки = Новый Массив(МалоценныеАктивы.Количество());
		МалоценныеАктивы.ЗагрузитьКолонку(МассивОчистки, "ПартияМалоценныхАктивовВЭксплуатации");
		
	КонецЕсли;
	
	ПлательщикНДС = УчетнаяПолитика.ПлательщикНДС(Организация, Дата);
	
	Если НЕ ПлательщикНДС Тогда
		
		// организация - не плательщик НДС. Установим во всех ТЧ признак соответствующего учета НДС
		НеОблНДСДеятельность = Справочники.НалоговыеНазначенияАктивовИЗатрат.НДС_НеоблагаемаяХозДеятельность;
		
		Для каждого СтрокаТЧ  Из МалоценныеАктивы Цикл
		    СтрокаТЧ.НалоговоеНазначение = НеОблНДСДеятельность;
		КонецЦикла; 
		
	КонецЕсли; 
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	ПроведениеСервер.ПодготовитьНаборыЗаписейКОтменеПроведения(ЭтотОбъект);
	Движения.Записать();
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)

	МассивНепроверяемыхРеквизитов = Новый Массив;

	ПлательщикНДС = УчетнаяПолитика.ПлательщикНДС(Организация, Дата);
	
	Если НЕ УказыватьПартию Тогда
		МассивНепроверяемыхРеквизитов.Добавить("МалоценныеАктивы.ПартияМалоценныхАктивовВЭксплуатации");
	КонецЕсли;

	Для Каждого Строка Из МалоценныеАктивы Цикл
		Если НЕ Строка.НазначениеИспользования.Пустая() Тогда
			
			Если Строка.Номенклатура <> Строка.НазначениеИспользования.Владелец Тогда
				ТекстСообщения = НСтр("ru='Назначение использования, выбранное в строке %1 табличной части, не соответствует номенклатуре %2.';uk='Призначення використання, вибране в рядку %1 табличної частини, не відповідає номенклатурі %2.'");
				ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, Строка.НомерСтроки, Строка.Номенклатура);
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, "МалоценныеАктивы[" + (Формат(Строка.НомерСтроки, "ЧН=; ЧГ=") - 1) + "].НазначениеИспользования", "Объект", Отказ);
			КонецЕсли;
			
			
			Если Строка.НазначениеИспользования.ВидМалоценногоАктива.Пустая() Тогда
				ТекстСообщения = НСтр("ru='В назначении использования, выбранном в строке %1 табличной части, не указан вид малоценного актива.';uk='У призначенні використання, вказаному в рядку %1 табличної частини, не зазначено вид малоцінного активу.'");
				ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, Строка.НомерСтроки);
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, "МалоценныеАктивы[" + (Формат(Строка.НомерСтроки, "ЧН=; ЧГ=") - 1) + "].НазначениеИспользования", "Объект", Отказ);
			КонецЕсли;
			
			Если Строка.НазначениеИспользования.СчетПередачиБУ.Пустая() Тогда
				ТекстСообщения = НСтр("ru='В назначении использования, выбранном в строке %1 табличной части, не указан счет передачи.';uk='У призначенні використання, вказаному в рядку %1 табличної частини, не вказаний рахунок передачі.'");
				ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, Строка.НомерСтроки);
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, "МалоценныеАктивы[" + (Формат(Строка.НомерСтроки, "ЧН=; ЧГ=") - 1) + "].НазначениеИспользования", "Объект", Отказ);
			КонецЕсли;
			
			Если Строка.НазначениеИспользования.ВидМалоценногоАктива <> мМБП И Строка.НазначениеИспользования.СчетПередачиБУ.Пустая() Тогда
				ТекстСообщения = НСтр("ru='В назначении использования, выбранном в строке %1 табличной части, не указан счет амортизации.';uk='У призначенні використання, вказаному в рядку %1 табличної частини, не вказаний рахунок амортизації.'");
				ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, Строка.НомерСтроки);
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, "МалоценныеАктивы[" + (Формат(Строка.НомерСтроки, "ЧН=; ЧГ=") - 1) + "].НазначениеИспользования", "Объект", Отказ);
			КонецЕсли;
			
		КонецЕсли;
	КонецЦикла;
	
	Если НЕ ПлательщикНДС Тогда
		МассивНепроверяемыхРеквизитов.Добавить("МалоценныеАктивы.НалоговоеНазначение");	
	КонецЕсли;	
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);

КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)

	Дата = НачалоДня(ОбщегоНазначенияБП.ПолучитьРабочуюДату());
	Ответственный = Пользователи.ТекущийПользователь();

КонецПроцедуры


//////////////////////////////////////////////////////////////////////////////// 
// ОПЕРАТОРЫ ОСНОВНОЙ ПРОГРАММЫ 
// 

мМБП                            = Перечисления.ВидыМалоценныхАктивов.МалоценныйБыстроизнашивающийсяПредмет;

#КонецЕсли
